{"modelTopology":{"class_name":"Sequential","config":{"name":"carbonintensity-kyuden-m476zz6m","layers":[{"class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"InputLayer","trainable":true,"batch_input_shape":[null,1,32],"dtype":"float32"}},{"class_name":"Reshape","config":{"target_shape":[16,4],"name":"reshape_Reshape9","trainable":true}},{"class_name":"RNN","config":{"name":"RNN","trainable":true,"cells":[{"class_name":"LSTMCell","config":{"name":"lstm_cell_LSTMCell17","trainable":true,"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null}},{"class_name":"LSTMCell","config":{"name":"lstm_cell_LSTMCell18","trainable":true,"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null}}],"batch_input_shape":[null,16,4],"dtype":"float32","return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"cell":{"class_name":"StackedRNNCells","config":{"name":"stacked_rnn_cells_StackedRNNCells9","trainable":true,"cells":[{"class_name":"LSTMCell","config":{"name":"lstm_cell_LSTMCell17","trainable":true,"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null}},{"class_name":"LSTMCell","config":{"name":"lstm_cell_LSTMCell18","trainable":true,"units":16,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null}}]}}}},{"class_name":"Dense","config":{"units":6,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"OutputLayer","trainable":true,"batch_input_shape":[null,16],"dtype":"float32"}}]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"InputLayer/kernel","shape":[32,64],"dtype":"float32"},{"name":"InputLayer/bias","shape":[64],"dtype":"float32"},{"name":"RNN/RNNCell_0/kernel","shape":[4,64],"dtype":"float32"},{"name":"RNN/RNNCell_0/recurrent_kernel","shape":[16,64],"dtype":"float32"},{"name":"RNN/RNNCell_0/bias","shape":[64],"dtype":"float32"},{"name":"RNN/RNNCell_1/kernel","shape":[16,64],"dtype":"float32"},{"name":"RNN/RNNCell_1/recurrent_kernel","shape":[16,64],"dtype":"float32"},{"name":"RNN/RNNCell_1/bias","shape":[64],"dtype":"float32"},{"name":"OutputLayer/kernel","shape":[16,6],"dtype":"float32"},{"name":"OutputLayer/bias","shape":[6],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}